app/views/posts/show.html.erb

                        <hr>
                        <%= render @post.comments.order("created_at DESC") %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY created_at DESC  [["post_id", 12]]