app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "tay"], ["body", "comment"], ["post_id", 7], ["created_at", "2017-08-07 18:09:23.362937"], ["updated_at", "2017-08-07 18:09:23.362937"]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params)