app/controllers/posts_controller.rb

    def update
        if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "flach message check edited"], ["updated_at", "2017-08-07 16:04:17.905481"], ["id", 8]]